Repository: wasimmostakim2965-ui/openclaw-windows-node
Catalog: src/OpenClaw.Tray.WinUI/Strings/*/Resources.resw
Source language: en_us
Languages: fr_fr, pt_br, zh_cn, zh_tw

# ChannelsPage_HelpGoogleChat
source: How to add a Google Chat webhook →
fr_fr: Comment ajouter un webhook Google Chat →
pt_br: Como adicionar um webhook do Google Chat →
zh_cn: 如何添加 Google Chat webhook →
zh_tw: 如何新增 Google Chat webhook →

# ChannelsPage_HelpSlack
source: Slack app dashboard →
fr_fr: Tableau de bord des applications Slack →
pt_br: Painel de apps do Slack →
zh_cn: Slack 应用控制台 →
zh_tw: Slack 應用程式控制台 →

# ChannelsPage_HelpNostr
source: About Nostr →
fr_fr: À propos de Nostr →
pt_br: Sobre o Nostr →
zh_cn: 关于 Nostr →
zh_tw: 關於 Nostr →

# ChannelsPage_HelpIMessage
source: About macOS Messages →
fr_fr: À propos de Messages sur macOS →
pt_br: Sobre o macOS Messages →
zh_cn: 关于 macOS“信息”→
zh_tw: 關於 macOS「訊息」→

# ChannelsPage_GuideWhatsAppHeadline
source: Link your WhatsApp phone
fr_fr: Associer votre téléphone WhatsApp
pt_br: Vincule seu telefone do WhatsApp
zh_cn: 关联您的 WhatsApp 手机
zh_tw: 連結您的 WhatsApp 手機

# ChannelsPage_GuideWhatsAppStep1
source: Click "Show QR" in the Linking section below.
fr_fr: Cliquez sur "Show QR" dans la section Liaison ci-dessous.
pt_br: Clique em "Mostrar QR" na seção Vinculação abaixo.
zh_cn: 点击下方“关联”部分中的 "Show QR"。
zh_tw: 點擊下方「連結」區段中的 "Show QR"。

# ChannelsPage_GuideWhatsAppStep2
source: On your phone: WhatsApp → Settings → Linked devices → Link a device.
fr_fr: Sur votre téléphone : WhatsApp → Paramètres → Appareils liés → Lier un appareil.
pt_br: No seu telefone: WhatsApp → Configurações → Dispositivos vinculados → Vincular um dispositivo.
zh_cn: 在手机上：WhatsApp → 设置 → 已关联设备 → 关联设备。
zh_tw: 在手機上：WhatsApp → 設定 → 已連結裝置 → 連結裝置。

# ChannelsPage_GuideWhatsAppStep3
source: Scan the QR code that appears here.
fr_fr: Scannez le code QR qui s’affiche ici.
pt_br: Escaneie o código QR que aparece aqui.
zh_cn: 扫描此处显示的 QR 码。
zh_tw: 掌描此處顯示的 QR 碼。

# ChannelsPage_GuideSignalHeadline
source: Link your Signal phone
fr_fr: Associer votre téléphone Signal
pt_br: Vincule seu telefone com Signal
zh_cn: 关联您的 Signal 手机
zh_tw: 連結您的 Signal 手機

# ChannelsPage_GuideSignalStep1
source: Click "Show QR" in the Linking section below.
fr_fr: Cliquez sur "Show QR" dans la section Liaison ci-dessous.
pt_br: Clique em "Mostrar QR" na seção Vinculação abaixo.
zh_cn: 点击下方“关联”部分中的 "Show QR"。
zh_tw: 點擊下方「連結」區段中的 "Show QR"。

# ChannelsPage_GuideSignalStep2
source: On your phone: Signal → Settings → Linked devices → Link new device.
fr_fr: Sur votre téléphone : Signal → Paramètres → Appareils liés → Lier un nouvel appareil.
pt_br: No seu telefone: Signal → Configurações → Dispositivos vinculados → Vincular novo dispositivo.
zh_cn: 在手机上：Signal → 设置 → 已关联设备 → 关联新设备。
zh_tw: 在手機上：Signal → 設定 → 已連結裝置 → 連結新裝置。

# ChannelsPage_GuideSignalStep3
source: Scan the QR code that appears here.
fr_fr: Scannez le code QR qui s’affiche ici.
pt_br: Escaneie o código QR que aparece aqui.
zh_cn: 扫描此处显示的 QR 码。
zh_tw: 掌描此處顯示的 QR 碼。

# ChannelsPage_GuideTelegramHeadline
source: Connect Telegram via a bot
fr_fr: Connecter Telegram via un bot
pt_br: Conecte o Telegram por meio de um bot
zh_cn: 通过机器人连接 Telegram
zh_tw: 透過機器人連接 Telegram

# ChannelsPage_GuideTelegramStep1
source: Open Telegram and send a message to @BotFather.
fr_fr: Ouvrez Telegram et envoyez un message à @BotFather.
pt_br: Abra o Telegram e envie uma mensagem para @BotFather.
zh_cn: 打开 Telegram 并向 @BotFather 发送消息。
zh_tw: 開啟 Telegram 並向 @BotFather 傳送訊息。

# ChannelsPage_GuideTelegramStep2
source: Send /newbot and follow the prompts. Copy the bot token at the end.
fr_fr: Envoyez /newbot et suivez les instructions. Copiez le jeton du bot à la fin.
pt_br: Envie /newbot e siga as instruções. Copie o token do bot ao final.
zh_cn: 发送 /newbot 并按照提示操作。最后复制机器人令牌。
zh_tw: 傳送 /newbot 並按照提示操作。最後複製機器人權杖。

# ChannelsPage_GuideTelegramStep3
source: Paste the token into the Configuration form below.
fr_fr: Collez le jeton dans le formulaire de configuration ci-dessous.
pt_br: Cole o token no formulário de Configuração abaixo.
zh_cn: 将令牌粘贴到下方的配置表单中。
zh_tw: 將權杖貼到下方的設定表單中。

# ChannelsPage_GuideTelegramStep4
source: Click "Save and start". The channel will start automatically.
fr_fr: Cliquez sur "Save and start". Le canal démarrera automatiquement.
pt_br: Clique em "Salvar e iniciar". O canal iniciará automaticamente.
zh_cn: 点击 "Save and start"。频道将自动启动。
zh_tw: 點擊 "Save and start"。頻道將自動啟動。

# ChannelsPage_GuideDiscordHeadline
source: Connect Discord via a bot
fr_fr: Connecter Discord via un bot
pt_br: Conecte o Discord por meio de um bot
zh_cn: 通过机器人连接 Discord
zh_tw: 透過機器人連接 Discord

# ChannelsPage_GuideDiscordStep1
source: Open the Discord Developer Portal, then create or select an application.
fr_fr: Ouvrez le portail des développeurs Discord, puis créez ou sélectionnez une application.
pt_br: Abra o Portal do Desenvolvedor do Discord e crie ou selecione um aplicativo.
zh_cn: 打开 Discord 开发者门户，然后创建或选择一个应用。
zh_tw: 開啟 Discord 開發者入口網站，然後建立或選取應用程式。

# ChannelsPage_GuideDiscordStep2
source: Open Bot, add a bot if needed, then reset and copy its token.
fr_fr: Ouvrez Bot, ajoutez un bot si nécessaire, puis réinitialisez et copiez son jeton.
pt_br: Abra Bot, adicione um bot se necessário e depois redefina e copie seu token.
zh_cn: 打开 Bot，按需添加机器人，然后重置并复制其令牌。
zh_tw: 開啟 Bot，視需要新增機器人，然後重設並複製其權杖。

# ChannelsPage_GuideDiscordStep3
source: Paste the bot token into the Configuration form below.
fr_fr: Collez le jeton du bot dans le formulaire de configuration ci-dessous.
pt_br: Cole o token do bot no formulário de Configuração abaixo.
zh_cn: 将机器人令牌粘贴到下方的配置表单中。
zh_tw: 將機器人權杖貼到下方的設定表單中。

# ChannelsPage_GuideDiscordStep4
source: Click "Save and start", then add the bot to your server with its OAuth2 installation link.
fr_fr: Cliquez sur "Save and start", puis ajoutez le bot à votre serveur avec son lien d’installation OAuth2.
pt_br: Clique em "Salvar e iniciar" e, em seguida, adicione o bot ao seu servidor com o link de instalação OAuth2.
zh_cn: 点击 "Save and start"，然后使用 OAuth2 安装链接将机器人添加到服务器。
zh_tw: 點擊 "Save and start"，然後使用 OAuth2 安裝連結將機器人新增到伺服器。

# ChannelsPage_GuideGoogleChatHeadline
source: Connect Google Chat via a webhook
fr_fr: Connecter Google Chat via un webhook
pt_br: Conecte o Google Chat por meio de um webhook
zh_cn: 通过 webhook 连接 Google Chat
zh_tw: 透過 webhook 連接 Google Chat

# ChannelsPage_GuideGoogleChatStep1
source: In Google Chat, open the space → Manage webhooks → Add webhook.
fr_fr: Dans Google Chat, ouvrez l’espace → Gérer les webhooks → Ajouter un webhook.
pt_br: No Google Chat, abra o espaço → Gerenciar webhooks → Adicionar webhook.
zh_cn: 在 Google Chat 中，打开聊天室 → 管理 webhook → 添加 webhook。
zh_tw: 在 Google Chat 中，開啟聊天室 → 管理 webhook → 新增 webhook。

# ChannelsPage_GuideGoogleChatStep2
source: Copy the webhook URL.
fr_fr: Copiez l’URL du webhook.
pt_br: Copie a URL do webhook.
zh_cn: 复制 webhook URL。
zh_tw: 複製 webhook URL。

# ChannelsPage_GuideGoogleChatStep3
source: Paste the URL into the Configuration form below.
fr_fr: Collez l’URL dans le formulaire de configuration ci-dessous.
pt_br: Cole a URL no formulário de Configuração abaixo.
zh_cn: 将 URL 粘贴到下方的配置表单中。
zh_tw: 將 URL 貼到下方的設定表單中。

# ChannelsPage_GuideGoogleChatStep4
source: Click "Save and start".
fr_fr: Cliquez sur "Save and start".
pt_br: Clique em "Salvar e iniciar".
zh_cn: 点击 "Save and start"。
zh_tw: 點擊 "Save and start"。

# ChannelsPage_GuideSlackHeadline
source: Connect Slack via an app
fr_fr: Connecter Slack via une application
pt_br: Conecte o Slack por meio de um aplicativo
zh_cn: 通过应用连接 Slack
zh_tw: 透過應用程式連接 Slack

# ChannelsPage_GuideSlackStep1
source: Create a Slack app at api.slack.com/apps and install it to your workspace.
fr_fr: Créez une application Slack sur api.slack.com/apps et installez-la dans votre espace de travail.
pt_br: Crie um app do Slack em api.slack.com/apps e instale-o no seu workspace.
zh_cn: 在 api.slack.com/apps 上创建 Slack 应用并将其安装到您的工作区。
zh_tw: 在 api.slack.com/apps 上建立 Slack 應用程式並將其安裝到您的工作區。

# ChannelsPage_GuideSlackStep2
source: Copy the bot token (xoxb-…) and the signing secret.
fr_fr: Copiez le jeton du bot (xoxb-…) et le secret de signature.
pt_br: Copie o token do bot (xoxb-…) e o signing secret.
zh_cn: 复制机器人令牌 (xoxb-…) 和签名密钥。
zh_tw: 複製機器人權杖 (xoxb-…) 和簽署密鑰。

# ChannelsPage_GuideSlackStep3
source: Paste both into the Configuration form below.
fr_fr: Collez les deux dans le formulaire de configuration ci-dessous.
pt_br: Cole ambos no formulário de Configuração abaixo.
zh_cn: 将两者粘贴到下方的配置表单中。
zh_tw: 將兩者貼到下方的設定表單中。

# ChannelsPage_GuideSlackStep4
source: Click "Save and start".
fr_fr: Cliquez sur "Save and start".
pt_br: Clique em "Salvar e iniciar".
zh_cn: 点击 "Save and start"。
zh_tw: 點擊 "Save and start"。

# ChannelsPage_GuideNostrHeadline
source: Connect Nostr via relays
fr_fr: Connecter Nostr via des relais
pt_br: Conecte o Nostr por meio de relays
zh_cn: 通过中继连接 Nostr
zh_tw: 透過中繼連接 Nostr

# ChannelsPage_GuideNostrStep1
source: Generate or paste a private key (nsec).
fr_fr: Générez ou collez une clé privée (nsec).
pt_br: Gere ou cole uma chave privada (nsec).
zh_cn: 生成或粘贴私钥 (nsec)。
zh_tw: 產生或貼上私鑰 (nsec)。

# ChannelsPage_GuideNostrStep2
source: Pick one or more relay URLs (e.g. wss://relay.damus.io).
fr_fr: Choisissez une ou plusieurs URL de relais (p. ex. wss://relay.damus.io).
pt_br: Escolha uma ou mais URLs de relay (ex.: wss://relay.damus.io).
zh_cn: 选择一个或多个中继 URL（例如 wss://relay.damus.io）。
zh_tw: 選擇一個或多個中繼 URL（例如 wss://relay.damus.io）。

# ChannelsPage_GuideNostrStep3
source: Paste both into the Configuration form below.
fr_fr: Collez les deux dans le formulaire de configuration ci-dessous.
pt_br: Cole ambos no formulário de Configuração abaixo.
zh_cn: 将两者粘贴到下方的配置表单中。
zh_tw: 將兩者貼到下方的設定表單中。

# ChannelsPage_GuideNostrStep4
source: Click "Save and start".
fr_fr: Cliquez sur "Save and start".
pt_br: Clique em "Salvar e iniciar".
zh_cn: 点击 "Save and start"。
zh_tw: 點擊 "Save and start"。

# ChannelsPage_GuideIMessageHeadline
source: iMessage is macOS-only
fr_fr: iMessage est réservé à macOS
pt_br: O iMessage é exclusivo do macOS
zh_cn: iMessage 仅适用于 macOS
zh_tw: iMessage 僅適用於 macOS

# ChannelsPage_GuideIMessageStep1
source: iMessage reads the local Messages.app database, which only exists on macOS.
fr_fr: iMessage lit la base de données locale de Messages.app, qui n’existe que sur macOS.
pt_br: O iMessage lê o banco de dados local do Messages.app, que só existe no macOS.
zh_cn: iMessage 读取本地 Messages.app 数据库，该数据库仅存在于 macOS 上。
zh_tw: iMessage 讀取本機 Messages.app 資料庫，該資料庫僅存在於 macOS 上。

# ChannelsPage_GuideIMessageStep2
source: To use iMessage with OpenClaw, run the gateway on a Mac instead of this Windows host.
fr_fr: Pour utiliser iMessage avec OpenClaw, exécutez la passerelle sur un Mac au lieu de cet hôte Windows.
pt_br: Para usar o iMessage com o OpenClaw, execute o Gateway em um Mac em vez deste host Windows.
zh_cn: 若要将 iMessage 与 OpenClaw 配合使用，请在 Mac 上运行网关，而非此 Windows 主机。
zh_tw: 若要將 iMessage 與 OpenClaw 搭配使用，請在 Mac 上執行閘道，而非此 Windows 主機。

# ChannelsPage_GuideIMessageStep3
source: All other channels in this list work fine from a Windows-hosted gateway.
fr_fr: Tous les autres canaux de cette liste fonctionnent correctement depuis une passerelle hébergée sous Windows.
pt_br: Todos os outros canais desta lista funcionam normalmente a partir de um Gateway hospedado no Windows.
zh_cn: 此列表中的所有其他频道都可以在 Windows 托管的网关上正常使用。
zh_tw: 此列表中的所有其他頻道都可以在 Windows 託管的閘道上正常使用。

# ChannelsPage_GuideGenericHeadline
source: Connect this channel
fr_fr: Connecter ce canal
pt_br: Conecte este canal
zh_cn: 连接此频道
zh_tw: 連接此頻道

# ChannelsPage_GuideGenericStep1
source: "{0}" is a plugin channel. Refer to its documentation for the fields it needs.
fr_fr: "{0}" est un canal de plugin. Consultez sa documentation pour connaître les champs requis.
pt_br: "{0}" é um canal de plugin. Consulte a documentação dele para saber quais campos são necessários.
zh_cn: "{0}" 是一个插件频道。请参阅其文档以了解所需字段。
zh_tw: "{0}" 是一個外掛頻道。請參閱其文件以了解所需欄位。

# ChannelsPage_GuideGenericStep2
source: Use "Open Config page" in the Configuration section below to add settings under channels.{0}.
fr_fr: Utilisez "Open Config page" dans la section Configuration ci-dessous pour ajouter des paramètres sous channels.{0}.
pt_br: Use "Abrir página de configuração" na seção Configuração abaixo para adicionar definições em channels.{0}.
zh_cn: 使用下方“配置”部分中的 "Open Config page" 在 channels.{0} 下添加设置。
zh_tw: 使用下方「設定」區段中的 "Open Config page" 在 channels.{0} 下新增設定。

# ChannelsPage_GuideGenericStep3
source: Save the config; OpenClaw will start the channel automatically.
fr_fr: Enregistrez la configuration ; OpenClaw démarrera le canal automatiquement.
pt_br: Salve a configuração; o OpenClaw iniciará o canal automaticamente.
zh_cn: 保存配置；OpenClaw 将自动启动频道。
zh_tw: 儲存設定；OpenClaw 將自動啟動頻道。

# ChannelsPage_FieldBotToken
source: Bot token
fr_fr: Jeton du bot
pt_br: Token do bot
zh_cn: 机器人令牌
zh_tw: 機器人權杖

# ChannelsPage_FieldDiscordBotToken
source: Discord Bot Token
fr_fr: Jeton du bot Discord
pt_br: Token do bot do Discord
zh_cn: Discord 机器人令牌
zh_tw: Discord 機器人權杖

# ChannelsPage_PlaceholderDiscordBotToken
source: Paste Discord bot token
fr_fr: Collez le jeton du bot Discord
pt_br: Cole o token do bot do Discord
zh_cn: 粘贴 Discord 机器人令牌
zh_tw: 貼上 Discord 機器人權杖

# ChannelsPage_FieldWebhookUrl
source: Webhook URL
fr_fr: URL du webhook
pt_br: URL do webhook
zh_cn: Webhook 网址
zh_tw: Webhook 網址

# ChannelsPage_FieldSigningSecret
source: Signing secret
fr_fr: Secret de signature
pt_br: Segredo de assinatura
zh_cn: 签名密钥
zh_tw: 簽署密鑰

# ChannelsPage_FieldPrivateKey
source: Private key (nsec)
fr_fr: Clé privée (nsec)
pt_br: Chave privada (nsec)
zh_cn: 私钥 (nsec)
zh_tw: 私鑰 (nsec)

# ChannelsPage_FieldRelayUrls
source: Relay URLs
fr_fr: URL des relais
pt_br: URLs dos relays
zh_cn: 中继 URL
zh_tw: 中繼 URL

# ChannelsPage_HelpBotToken
source: Get from @BotFather (/newbot).
fr_fr: Obtenez-le auprès de @BotFather (/newbot).
pt_br: Obtenha em @BotFather (/newbot).
zh_cn: 从 @BotFather (/newbot) 获取。
zh_tw: 從 @BotFather (/newbot) 取得。

# ChannelsPage_HelpDiscordBotToken
source: Copy from Discord Developer Portal → Bot → Reset Token.
fr_fr: Copiez-le depuis le portail des développeurs Discord → Bot → Reset Token.
pt_br: Copie no Portal do Desenvolvedor do Discord → Bot → Reset Token.
zh_cn: 从 Discord 开发者门户 → Bot → Reset Token 复制。
zh_tw: 從 Discord 開發者入口網站 → Bot → Reset Token 複製。

# ChannelsPage_HelpWebhookGoogleChat
source: Open a space → Manage webhooks → Add webhook.
fr_fr: Ouvrez un espace → Gérer les webhooks → Ajouter un webhook.
pt_br: Abra um espaço → Gerenciar webhooks → Adicionar webhook.
zh_cn: 打开聊天室 → 管理 webhook → 添加 webhook。
zh_tw: 開啟聊天室 → 管理 webhook → 新增 webhook。

# ChannelsPage_HelpSlackBotToken
source: OAuth tokens from your Slack app.
fr_fr: Jetons OAuth de votre application Slack.
pt_br: Tokens OAuth do seu app do Slack.
zh_cn: 来自您 Slack 应用的 OAuth 令牌。
zh_tw: 來自您 Slack 應用程式的 OAuth 權杖。

# ChannelsPage_HelpRelayUrls
source: One per line.
fr_fr: Une par ligne.
pt_br: Uma por linha.
zh_cn: 每行一个。
zh_tw: 每行一個。

# ChannelsPage_SaveChanges
source: Save changes
fr_fr: Enregistrer les modifications
pt_br: Salvar alterações
zh_cn: 保存更改
zh_tw: 儲存變更

# ChannelsPage_SaveAndStart
source: Save and start
fr_fr: Enregistrer et démarrer
pt_br: Salvar e iniciar
zh_cn: 保存并启动
zh_tw: 儲存並啟動

# ChannelsPage_OpenConfigPage
source: Open Config page
fr_fr: Ouvrir la page de configuration
pt_br: Abrir página de configuração
zh_cn: 打开配置页面
zh_tw: 開啟設定頁面

# ChannelsPage_ConfigPlaceholderConfigured
source: Edit this channel's settings in the gateway Config page.
fr_fr: Modifiez les paramètres de ce canal dans la page de configuration de la passerelle.
pt_br: Edite as configurações deste canal na página Config do Gateway.
zh_cn: 在网关配置页面中编辑此频道的设置。
zh_tw: 在閘道設定頁面中編輯此頻道的設定。

# ChannelsPage_ConfigPlaceholderUnconfigured
source: After following the steps above, save the config to start the channel.
fr_fr: Après avoir suivi les étapes ci-dessus, enregistrez la configuration pour démarrer le canal.
pt_br: Depois de seguir os passos acima, salve a configuração para iniciar o canal.
zh_cn: 按照上述步骤操作后，保存配置以启动频道。
zh_tw: 按照上述步驟操作後，儲存設定以啟動頻道。

# ChannelsPage_BannerNotConnectedTitle
source: Not connected
fr_fr: Non connecté
pt_br: Não conectado
zh_cn: 未连接
zh_tw: 未連線

# ChannelsPage_BannerNotConnectedMessage
source: Connect to a gateway before saving channel config.
fr_fr: Connectez-vous à une passerelle avant d’enregistrer la configuration du canal.
pt_br: Conecte-se a um Gateway antes de salvar a configuração do canal.
zh_cn: 请先连接到网关，然后再保存频道配置。
zh_tw: 請先連線到閘道，然後再儲存頻道設定。

# ChannelsPage_BannerMissingFieldTitle
source: Missing field
fr_fr: Champ manquant
pt_br: Campo ausente
zh_cn: 缺少字段
zh_tw: 缺少欄位

# ChannelsPage_BannerMissingFieldMessage
source: {0} is required.
fr_fr: {0} est requis.
pt_br: {0} é obrigatório.
zh_cn: {0} 为必填项。
zh_tw: {0} 為必填項。

# ChannelsPage_BannerSavingTitle
source: Saving {0}…
fr_fr: Enregistrement de {0}…
pt_br: Salvando {0}…
zh_cn: 正在保存 {0}…
zh_tw: 正在儲存 {0}…

# ChannelsPage_BannerSavingMessage
source: Writing {0} field(s) and enabling the channel.
fr_fr: Écriture de {0} champ(s) et activation du canal.
pt_br: Gravando {0} campo(s) e ativando o canal.
zh_cn: 正在写入 {0} 个字段并启用频道。
zh_tw: 正在寫入 {0} 個欄位並啟用頻道。

# ChannelsPage_BannerCantLoadConfigTitle
source: Couldn’t load gateway config
fr_fr: Impossible de charger la configuration de la passerelle
pt_br: Não foi possível carregar a configuração do Gateway
zh_cn: 无法加载网关配置
zh_tw: 無法載入閘道設定

# ChannelsPage_BannerCantLoadConfigMessage
source: The gateway didn’t return its current config: can’t safely save without it. Try Refresh and save again.
fr_fr: La passerelle n’a pas renvoyé sa configuration actuelle: impossible d’enregistrer en toute sécurité sans elle. Essayez d’actualiser et d’enregistrer à nouveau.
pt_br: O Gateway não retornou sua configuração atual: não é possível salvar com segurança sem ela. Tente Atualizar e salvar novamente.
zh_cn: 网关未返回其当前配置……没有它无法安全保存。请尝试刷新并重新保存。
zh_tw: 閘道未傳回其目前設定……沒有它無法安全儲存。請嘗試重新整理並再次儲存。

# ChannelsPage_BannerConfigClearedMessage
source: The gateway’s config was cleared mid-save. Try Refresh and save again.
fr_fr: La configuration de la passerelle a été effacée en cours d’enregistrement. Essayez d’actualiser et d’enregistrer à nouveau.
pt_br: A configuração do Gateway foi apagada durante o salvamento. Tente Atualizar e salvar novamente.
zh_cn: 网关配置在保存过程中被清除。请尝试刷新并重新保存。
zh_tw: 閘道設定在儲存過程中被清除。請嘗試重新整理並再次儲存。

# ChannelsPage_BannerSaveBlockedTitle
source: Save blocked for {0}
fr_fr: Enregistrement bloqué pour {0}
pt_br: Salvamento bloqueado para {0}
zh_cn: {0} 的保存被阻止
zh_tw: {0} 的儲存被封鎖

# ChannelsPage_BannerGatewayNoResponse
source: The gateway didn’t respond.
fr_fr: La passerelle n’a pas répondu.
pt_br: O Gateway não respondeu.
zh_cn: 网关未响应。
zh_tw: 閘道未回應。

# ChannelsPage_BannerSaveFailedTitle
source: Save failed for {0}
fr_fr: Échec de l’enregistrement pour {0}
pt_br: Falha ao salvar {0}
zh_cn: {0} 的保存失败
zh_tw: {0} 的儲存失敗

# ChannelsPage_BannerStaleConfigMessage
source: Your gateway config changed elsewhere (e.g., from the Config page). We refreshed the cache. Try Save again. Details: {0}
fr_fr: La configuration de votre passerelle a été modifiée ailleurs (p. ex., depuis la page de configuration). Nous avons actualisé le cache. Réessayez d’enregistrer. Détails : {0}
pt_br: A configuração do seu Gateway foi alterada em outro lugar (por exemplo, pela página Config). Atualizamos o cache. Tente Salvar novamente. Detalhes: {0}
zh_cn: 您的网关配置已在其他位置更改（例如，从配置页面）。我们已刷新缓存……请再次尝试保存。详细信息：{0}
zh_tw: 您的閘道設定已在其他位置變更（例如，從設定頁面）。我們已重新整理快取……請再次嘗試儲存。詳細資訊：{0}

# ChannelsPage_BannerSaveFailedMessage
source: {0} If this looks like a wire-format mismatch, open the Config page for direct JSON editing.
fr_fr: {0} Si cela ressemble à une incompatibilité de format filaire, ouvrez la page de configuration pour modifier directement le JSON.
pt_br: {0} Se isso parecer uma incompatibilidade de formato, abra a página Config para edição direta em JSON.
zh_cn: {0} 如果这看起来像是线路格式不匹配，请打开配置页面进行直接 JSON 编辑。
zh_tw: {0} 如果這看起來像是線路格式不符，請開啟設定頁面進行直接 JSON 編輯。

# ChannelsPage_BannerConfigSavedTitle
source: {0} config saved
fr_fr: Configuration de {0} enregistrée
pt_br: Configuração de {0} salva
zh_cn: {0} 配置已保存
zh_tw: {0} 設定已儲存

# ChannelsPage_BannerConfigSavedMessage
source: Waiting for the gateway to confirm the channel is running…
fr_fr: En attente de la confirmation par la passerelle que le canal est en cours d’exécution…
pt_br: Aguardando o Gateway confirmar que o canal está em execução…
zh_cn: 正在等待网关确认频道已运行…
zh_tw: 正在等待閘道確認頻道已執行…

# ConnectionPage_GatewayHostControlsTitle.Text
source: WSL gateway
fr_fr: Passerelle WSL
pt_br: Gateway WSL
zh_cn: WSL 网关
zh_tw: WSL 閘道

# ConnectionPage_GatewayHostControlsDescription.Text
source: Open a shell or manage the local gateway service in WSL.
fr_fr: Ouvrez un shell ou gérez le service de passerelle locale dans WSL.
pt_br: Abra um shell ou gerencie o serviço de Gateway local no WSL.
zh_cn: 打开 shell，或在 WSL 中管理本地网关服务。
zh_tw: 開啟 shell，或在 WSL 中管理本機閘道服務。

# ConnectionPage_GatewayHostTerminalLabel.Text
source: Terminal
fr_fr: Invite de commandes
pt_br: Janela de terminal
zh_cn: 终端
zh_tw: 終端機

# ConnectionPage_GatewayHostStartButton.Content
source: Start
fr_fr: Démarrer
pt_br: Iniciar
zh_cn: 启动
zh_tw: 啟動

# ConnectionPage_GatewayHostStopButton.Content
source: Stop
fr_fr: Arrêter
pt_br: Parar
zh_cn: 停止
zh_tw: 停止

# ConnectionPage_GatewayHostRestartButton.Content
source: Restart
fr_fr: Redémarrer
pt_br: Reiniciar
zh_cn: 重启
zh_tw: 重新啟動

source: Open terminal
fr_fr: Ouvrir le terminal
pt_br: Abrir terminal
zh_cn: 打开终端
zh_tw: 開啟終端機

source: Open dashboard (in browser)
fr_fr: Ouvrir le tableau de bord (dans le navigateur)
pt_br: Abrir painel (no navegador)
zh_cn: 在浏览器中打开仪表板
zh_tw: 在瀏覽器中開啟儀表板

source: Open dashboard
fr_fr: Ouvrir le tableau de bord
pt_br: Abrir painel
zh_cn: 打开仪表板
zh_tw: 開啟儀表板

source: Disconnect / reconnect
fr_fr: Déconnecter / reconnecter
pt_br: Desconectar / reconectar
zh_cn: 断开/重新连接
zh_tw: 中斷連線/重新連線

source: Disconnect or reconnect
fr_fr: Déconnecter ou reconnecter
pt_br: Desconectar ou reconectar
zh_cn: 断开连接或重新连接
zh_tw: 中斷連線或重新連線

source: Run openclaw gateway start in WSL
fr_fr: Exécuter openclaw gateway start dans WSL
pt_br: Executar openclaw gateway start no WSL
zh_cn: 在 WSL 中运行 openclaw gateway start
zh_tw: 在 WSL 中執行 openclaw gateway start

source: Start WSL gateway
fr_fr: Démarrer la passerelle WSL
pt_br: Iniciar Gateway WSL
zh_cn: 启动 WSL 网关
zh_tw: 啟動 WSL 閘道

source: Run openclaw gateway stop in WSL
fr_fr: Exécuter openclaw gateway stop dans WSL
pt_br: Executar openclaw gateway stop no WSL
zh_cn: 在 WSL 中运行 openclaw gateway stop
zh_tw: 在 WSL 中執行 openclaw gateway stop

source: Stop WSL gateway
fr_fr: Arrêter la passerelle WSL
pt_br: Parar Gateway WSL
zh_cn: 停止 WSL 网关
zh_tw: 停止 WSL 閘道

source: Run openclaw gateway restart in WSL
fr_fr: Exécuter openclaw gateway restart dans WSL
pt_br: Executar openclaw gateway restart no WSL
zh_cn: 在 WSL 中运行 openclaw gateway restart
zh_tw: 在 WSL 中執行 openclaw gateway restart

source: Restart WSL gateway
fr_fr: Redémarrer la passerelle WSL
pt_br: Reiniciar Gateway WSL
zh_cn: 重启 WSL 网关
zh_tw: 重新啟動 WSL 閘道

# AgentEventsPage_Status_Live
source: Live
fr_fr: En direct
pt_br: Ao vivo
zh_cn: 实时
zh_tw: 即時

# AgentEventsPage_Status_Offline
source: Offline
fr_fr: Hors ligne
pt_br: Desconectado
zh_cn: 离线
zh_tw: 離線

# Command_GoToNotifications_Subtitle
source: Review active app notifications
fr_fr: Consulter les notifications actives de l'application
pt_br: Revisar notificações ativas do aplicativo
zh_cn: 查看活动的应用通知
zh_tw: 檢閱作用中的應用程式通知

# Command_GoToNotifications_Title
source: Go to Notifications
fr_fr: Accéder à Notifications
pt_br: Ir para Notificações
zh_cn: 转到通知
zh_tw: 前往通知

# ConfigPage_CheckingConfigPermissions
source: Checking config permissions
fr_fr: Vérification des autorisations de configuration
pt_br: Verificando permissões de configuração
zh_cn: 正在检查配置权限
zh_tw: 正在檢查設定權限
